#!/bin/bash

#printf 可以设置文本宽度，格式化字符串，左右对齐等功能，比echo要强大很多，但printf默认不换行

#语法：printf ormat-string  [arguments...]； ormat-string是格式控制字符串 arguments为参数列表

printf "你好 \n"
echo "-------------------------------------------------------------"
## $s $c $f $d 都是格式替代符
## $s 表示输出一个字符串; $-10s中的10表示宽度为10个字符串，超出显示不足空格显示，-表示左对齐（没有为右对齐）
## $c 表示输出一个字符串
## $f 输出实数已小数点输出; $10.2f 格式为小数 .2表示保留两位小数
## $d 整型输出
printf "%-10s %-8s %-10s %-10s\n"   姓名 性别 职务 价格
printf "%-10s %-8s %-10s %-10.2f\n" 霍去 男 将军 6.999

echo "------------------------------------------------------------------"
printf "%-10s %-8s %-4s\n" 姓名 性别 体重kg  
printf "%-10s %-8s %-4.2f\n" 郭靖 男 66.1234
printf "%-10s %-8s %-4.2f\n" 杨过 男 48.6543
printf "%-10s %-8s %-4.2f\n" 郭芙 女 47.9876